<!DOCTYPE html>
<html >
  <head>
    <meta charset="UTF-8">
    <title>BLOG</title>






        <link rel="stylesheet" href="css/style.css">




  </head>

  <body>

    <!--CONTAINER-->
<div class="container">
   <!--ROW-->
      <div class="title">
         <p align="left"><a href='http://www.abdullahvelioglu.com/newblog' style='text-decoration:none;'><font color="white">&nbsp; &nbsp; Geri</font></a> </p>
         <p align="right"><a href='http://www.abdullahvelioglu.com/' style='text-decoration:none;'><font color="white">&nbsp; &nbsp; Anasayfa</font></a> </p>
         <h6>DataBase Management System</h6>
          </div>   </div>
<br><br><br><br><br><br><br><br><br><br><br><br>
          <!--İTEM-->
                <div class="col-4-grid">
                   <div class="item">
                      <div class="front-end">
                        <div class="item-title">Veri Tabanlarında Normalizasyon </div>
                         <img src="http://www.abdullahvelioglu.com/icon/database/blog-1-2.jpg" alt="" />
                      </div>
                      <div class="back-end">
                        <div class="item-image">
                          <img src="http://www.abdullahvelioglu.com/icon/database/blog-1-1.jpg" alt="" />
                        </div>
                        <div class="item-title">Veri Tabanlarında Normalizasyon </div>

           <!-- Sayfa İçeriği -->

                              <br>
                              <p>İster web uygulaması&nbsp;ister masa&uuml;st&uuml; yazılım olsun hemen her bilgisayar programının&nbsp;en temel ihtiyacı veri tabanıdır kuşkusuz. Ancak ne acıdır ki yazılımcıların, &ouml;zellikle de&nbsp;web geliştiricilerinin en donanımsız olduğu alanlardan biri de budur sanırım.</p>
          <p>Eğer siz de&nbsp;projeniz i&ccedil;in bir veri tabanı oluştururken, ihtiya&ccedil; duyduğunuz t&uuml;m bilgileri tek bir tabloya, tesbih tanesi gibi dizenlerdenseniz bu konu sizi &ccedil;ok ilgilendiriyor &ccedil;&uuml;nk&uuml; bakkal defteri ile veri tabanı arasındaki en temel fark normalizasyondur.</p>
          <p>&nbsp;</p>
          <h3>G&uuml;&ccedil;l&uuml;, hızlı ve sağlıklı bir veri tabanı oluşturmanın olmazsa olmazı normalizasyon yapmaktır.</h3>
          <p>Ge&ccedil;enlerde veritabani dersinin ödevini yaparken orta &ccedil;aplı bir proje i&ccedil;in yaklaşık 1000 satır veri tutması gereken bir veri tabanı tasarlamam gerekti. Tasarımı tamamlayıp kayıtları veri tabanına aktardıktan sonra veri tabanının performansını g&ouml;rebilmek i&ccedil;in &uuml;zerinde bazıları basit, bazıları karmaşık sorgular &ccedil;alıştırdım. G&ouml;rd&uuml;m ki bazı&nbsp;karmaşık sorgularda cevap s&uuml;resi&nbsp;6 - 7 saniyeyi bulabiliyor.</p>
          <p>Bu makaleyi yazmaya karar verince aynı veri tabanını bakkal defteri formunda, yukarıda bahsettiğim gibi tesbih tanesi normunda tekrar oluşturup aynı cevap k&uuml;mesini alan sorgular&nbsp;&ccedil;alıştırdım.</p>
          <p>İlk veri tabanında cevap s&uuml;resi 6sn. olan sorgunun eşdeğeri bu veri tabanında 1&nbsp;dakikadan&nbsp;uzun s&uuml;rd&uuml;... 10 katından fazla.</p>
          <p>Peki bu kadar b&uuml;y&uuml;k farkı doğuran neydi?</p>
          <p>&nbsp;</p>
          <h2>Normalizasyon Nedir?</h2>
          <p>Normalizasyonun iki temel amacı vardır. Veri tabanında veri tekrarlarını ortadan kaldırmak&nbsp;ve&nbsp;veri tutarlılığını (doğruluğunu) artırmak.</p>
          <p>Normalizasyon, veri tabanlarına seviyelerle (normal formlar)&nbsp;uygulanır. Bir veri tabanının bu normal formlardan herhangi birine uygun olduğunu s&ouml;yleyebilmek i&ccedil;in, s&ouml;z konusu normal formun t&uuml;m kriterlerini eksiksiz yerine getiriyor olması şarttır.</p>
          <p>Başarılı bir şekilde uygulandığında normalizasyon işlemi veri tabanının s&uuml;ratini&nbsp;b&uuml;y&uuml;k oranda artırır. Veri tabanının sabit diskteki boyutunu azaltır. Ayrıca veri tutarlılığını artırarak veri tekrarlarını engeller. Bilmem, &ouml;zellikle g&uuml;ncelleme ve silme işlemlerinde ortaya &ccedil;ıkabilecek aksaklıkları minimize ettiğini&nbsp;s&ouml;ylemeye gerek var mı?</p>
          <p>&nbsp;</p>
          <h3>Normal Formlar</h3>
          <p>Basit&ccedil;e tanımlamak gerekirse, normal formlar&nbsp;normalizasyon seviyeleridir. Bu seviyeler&nbsp;gereksiz veri tekrarlarını ne derecede engellediği ve tutarlılığı ne kadar sağladığına bağlı olarak derecelendirilir. Seviye y&uuml;kseldik&ccedil;e veri tutarlılığı artar, veri tekrarı d&uuml;şer.</p>
          <p>Normalizasyon seviyeleri 1NF (Birinci Normal Form), 2NF, 3NF, BCNF(Boyce-Codd Normal Form, 3.5NF'de denir), 4NF şeklinde adlandırılır ve yukarı doğru devam eder. Ancak daha yukarı normalizasyon seviyeleri &ccedil;ok nadiren kullanılır &ccedil;&uuml;nk&uuml;&nbsp;&ccedil;oğu zaman uygulanması m&uuml;mk&uuml;n olmayabilir.</p>
          <p>Konuyu detaylandırabilmek i&ccedil;in bir veri tabanı oluşturalım ve normalizasyonunu yapalım. Tabloda bir teknik destek firmasının &ccedil;alışanları, servis&nbsp;ara&ccedil;ları, servis sof&ouml;rleri ve servis verilen semtler bulunsun.&nbsp;Her bir şof&ouml;r&nbsp;tek ara&ccedil; ile semt bazında servis yapmaktadır. &Ouml;rneğin şof&ouml;r "Ahmet", teknik elemanları&nbsp;(&ccedil;alışanları)&nbsp;"Toyota" ara&ccedil;la, "Levent", "Etiler"&nbsp;ve "Ulus"&nbsp;semtlerindeki&nbsp;destek &ccedil;ağrılarına g&ouml;t&uuml;rmektedir.</p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Levent, Etiler, Ulus</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Bakırk&ouml;y, Atak&ouml;y, Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kandilli, Beylerbeyi,&nbsp;Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p>&Ccedil;oğu programcı i&ccedil;in veri tabanı tasarımı burada biter. Cılkını&nbsp;&ccedil;ıkartmaya&nbsp;gerek yok, değil mi? Bu arkadaşlara tavsiyem: Wordpress'ten şaşmayın, sizi o paklar...</p>
          <p>İşin doğrusu, veri tabanımızı oluşturmaya hen&uuml;z başladık.</p>
          <p>&nbsp;</p>
          <h3>1NF (1. Normal Form)</h3>
          <p>Bir veri tabanının 1NF olabilmesi i&ccedil;in aşağıdaki &ouml;zellikleri karşılayabilmesi gerekir:</p>
          <ul>
          <li>Aynı tablo i&ccedil;inde&nbsp;tekrarlayan kolonlar bulunamaz,</li>
          <li>Her kolonda yalnızca bir değer bulunabilir (bkz.&nbsp;"Semt" kolonu)</li>
          <li>Her satır bir eşsiz anahtarla tanımlanmalıdır (Unique Key - Primary Key)</li>
          </ul>
          <p>Veri tabanımızda ikinci kurala a&ccedil;ık&ccedil;a uymayan bir kolon var: Semt. Bu durumu d&uuml;zeltmek i&ccedil;in tekrar d&uuml;zenleyelim:</p>
          <p><strong>Ana Tablo</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th><th style="text-align: left;">Semt 1</th><th style="text-align: left;">Semt 2</th><th style="text-align: left;">Semt 3</th></tr>
          <tr>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Levent</td>
          <td>Etiler</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Bakırk&ouml;y</td>
          <td>Atak&ouml;y</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kandilli</td>
          <td>Beylerbeyi</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p>Bir sorun var. Tablo bu şekliyle birinci kuralla &ccedil;elişti. Semt 1, Semt 2, Semt 3 tekrarlayan kolonlar. Bir daha deneyelim:</p>
          <p><strong>Ana Tablo</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Levent</td>
          </tr>
          <tr>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Etiler</td>
          </tr>
          <tr>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Bakırk&ouml;y</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Atak&ouml;y</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kandilli</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Beylerbeyi</td>
          </tr>
          <tr>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p>Evet, şimdi oldu. Tekrar eden kolonlar yok. Bir kolonda birden &ccedil;ok veri yok. S&uuml;per. Pardon? Eşsiz anahtar mı dediniz? Doğru... E, nasıl yaparız?</p>
          <p>&Ouml;nce &nbsp;"aday anahtar" (candidate key) ve "eşsiz anahtar" (primary key) kavramlarına bir g&ouml;z atalım o zaman:</p>
          <p><strong>Aday Anahtar (Candidate Key):</strong>&nbsp;Bir ya da daha fazla kolondan meydana gelir.&nbsp;Tablonun her bir veri satırını eşsiz olarak tanımlar, başka bir deyişle tabloda ka&ccedil; satır olursa olsun bu kombinasyonu bulunduran birden fazla satır asla olamaz. &Ouml;rneğin, "&Ccedil;alışan - Soyad" kombinasyonu&nbsp;bir&nbsp;aday anahtar değildir &ccedil;&uuml;nk&uuml; 1, 2 ve 3&uuml;nc&uuml; satırlar ve 4, 5, 6, 7, 8 ve 9uncu satırlarda değerler tekrar etmektedir.&nbsp;&Ouml;te yandan&nbsp;"&Ccedil;alışan - Semt" kombinasyonu hi&ccedil; bir şekilde tekrar etmiyor.&nbsp;&Ouml;yleyse&nbsp;<span style="line-height: 1.6;">"&Ccedil;alışan - Semt" kombinasyonu bir <strong>aday anahtar</strong>dır.</span></p>
          <p><span style="line-height: 1.6;"><strong>Eşsiz Anahtar (Primary Key):</strong>&nbsp;Tablodaki aday anahtarlardan herhangi birini eşsiz anahtar olarak atayabiliriz. Bu anahtar tablodaki satırları tanımlamak i&ccedil;in kullanılır ve bir tabloda yalnızca 1 tane eşsiz anahtar bulunabilir.</span></p>
          <p><span style="line-height: 1.6;">Tablomuza d&ouml;necek olursak,&nbsp;</span><span style="line-height: 1.6;">"&Ccedil;alışan - Semt" kombinasyonunu eşsiz anahtar olarak atayabiliriz.&nbsp;Elimizdeki &ouml;rnek son derece basit bir tablo olduğundan sorun yok ama daha karmaşık işlerde eşsiz anahtar i&ccedil;in kolon kombinasyonlarını pek tercih etmiyoruz.&nbsp;Eh, sonu&ccedil;ta veri tabanlarına <strong>Auto Increment (Otomatik Sayı - Otomatik Artış)&nbsp;</strong>fonksiyonlarını spor olsun diye koymuyorlar, değil mi?</span></p>
          <p>&nbsp;</p>
          <p><strong>Ana Tablo</strong>&nbsp;</p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Id</th><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>1</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Levent</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Etiler</td>
          </tr>
          <tr>
          <td>3</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>4</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Bakırk&ouml;y</td>
          </tr>
          <tr>
          <td>5</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Atak&ouml;y</td>
          </tr>
          <tr>
          <td>6</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>7</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kandilli</td>
          </tr>
          <tr>
          <td>8</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Beylerbeyi</td>
          </tr>
          <tr>
          <td>9</td>
          <td>Metin</td>
          <td>Seyyar</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>İşte şimdi oldu. "Id" s&uuml;tununu eşsiz anahtar olarak atadık. 1NF kurallarına harfiyen uyduk. S&uuml;periz...</p>
          <p>&nbsp;</p>
          <h3>2NF (2. Normal Form)</h3>
          <p style="font-family: Roboto, sans-serif; font-size: 18px; font-weight: normal; line-height: 28.799999237060547px;">Bir veri tabanının 2NF olabilmesi i&ccedil;in aşağıdaki &ouml;zellikleri karşılayabilmesi gerekir:</p>
          <ul>
          <li><span style="line-height: 1.6;">Tablo 1NF olmalıdır,</span></li>
          <li><span style="line-height: 1.6;">Anahtar olmayan değerler ile kompozit (bileşik) anahtarlar arasında kısmi (partial)&nbsp;bağımlılık durumu oluşmamalıdır. Kısmi bağımlılık durumu, anahtar olmayan herhangi bir değer kompozit bir anahtarın yalnızca bir kısmına bağıl ise oluşur. (Evet farkındayım &ccedil;ok karmaşık g&ouml;r&uuml;n&uuml;yor, &ouml;rnekte net bir şekilde anlayacaksınız. S&ouml;z...)</span></li>
          <li>Herhangi bir veri alt k&uuml;mesi birden &ccedil;ok satırda tekrarlanmamalıdır. Bu t&uuml;r veri&nbsp;alt k&uuml;meleri&nbsp;i&ccedil;in yeni tablolar oluşturulmalıdır.</li>
          <li>Ana tablo ile yeni tablolar arasında, dış anahtarlar (foreign key) kullanılarak ilişkiler tanımlanmalıdır.</li>
          </ul>
          <p>Aslında &uuml;&ccedil;&nbsp;ve d&ouml;rd&uuml;nc&uuml; maddeler ikinci maddenin sonu&ccedil;larıdır. Eğer anahtar olmayan bir kolonla herhangi bir komposit anahtar arasında kısmi bağımlılık varsa her zaman tekrarlayan veri alt k&uuml;meleri oluşur. Bu durumu d&uuml;zeltmek i&ccedil;in bahis konusu alt k&uuml;meleri farklı bir tablo haline getirmeli ve elde ettiğimiz tablolar ile ana tablomuz arasındaki ilişkiyi tanımlamalıyız.</p>
          <p>Tablomuzu bir g&ouml;zden ge&ccedil;irelim: "&Ccedil;alışan - Soyad" kombinasyonuna bakın. &Ccedil;ok tekrarlanıyor &ccedil;&uuml;nk&uuml; eşsiz anahtara verimli bir şekilde bağlayamamışız. Bunu d&uuml;zeltmek i&ccedil;in&nbsp;tablomuzu aşağıdaki gibi ikiye b&ouml;lelim ve aralarında bir ilişki oluşturalım:</p>
          <p><strong>Ana Tablo</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Id</th><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th></tr>
          <tr>
          <td>1</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Metin</td>
          <td>Seyyar</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Servis Tablosu</strong>&nbsp;</p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Cid</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>1</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Levent</td>
          </tr>
          <tr>
          <td>1</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Etiler</td>
          </tr>
          <tr>
          <td>1</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Bakırk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Atak&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Mehmet</td>
          <td>Honda</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kandilli</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Beylerbeyi</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Tolga</td>
          <td>Ford</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>Yeni tablomuz ile ana tablomuzu ilişkilendirmek i&ccedil;in "Cid" (&Ccedil;alışan ID) isimli bir kolon&nbsp;yarattık. Dikkat ederseniz bu kolonun aldığı değer ana tablomuzdaki eşsiz anahtarı işaret ediyor. Bu ilişkilendirmeye <strong>Foreign Key</strong>&nbsp;diyoruz.</p>
          <p>Ayrıca bilmem s&ouml;ylemeye gerek var mı, Şof&ouml;r - Ara&ccedil; - Semt kombinasyonu bu yeni tablomuzun eşsiz anahtarı olarak gayet iyi iş g&ouml;r&uuml;yor.</p>
          <p>Evet, artık bu noktada 2NF işini hallettik diyebiliriz.</p>
          <p>&nbsp;</p>
          <h3>3NF (3. Normal Form)</h3>
          <p><span style="font-family: Roboto, sans-serif; font-size: 18px; line-height: 1.6;">Bir veri tabanının 3NF olabilmesi i&ccedil;in aşağıdaki &ouml;zellikleri karşılayabilmesi gerekir:</span></p>
          <ul>
          <li>Veri tabanı 2NF olmalıdır,</li>
          <li>Anahtar olmayan hi&ccedil; bir kolon bir diğerine (anahtar olmayan başka bir kolona) bağıl olmamalı ya da ge&ccedil;işken fonksiyonel bir bağımlılığı (transitional functional dependency) olmamalıdır. Başka bir deyişle her kolon eşsiz anahtara tam bağımlı olmak zorundadır.</li>
          </ul>
          <p>Veri tabanımızı 3NF şartlarına uydurabilmek i&ccedil;in anahtar olmayan ve eşsiz anahtara tam bağımlı olmayan t&uuml;m kolonları kaldırmalıyız. Dikkat ederseniz bizim tablomuzda "Ara&ccedil;" kolonu eşsiz anahtarımıza değil "Şof&ouml;r" kolonuna bağımlı. Birbirine bağlı olan bu iki kolonu (Şof&ouml;r - Ara&ccedil;) ayrı bir tabloya ayırmamız ve tablomuzla aralarında bir ilişki yaratmamız gerekiyor.</p>
          <p><strong>Ana Tablo</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th>Id</th><th>Calisan</th><th>Soyad</th></tr>
          <tr>
          <td>1</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Metin</td>
          <td>Seyyar</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Servis Tablosu&nbsp;</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Cid</th><th style="text-align: left;">Sid</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>1</td>
          <td>1</td>
          <td>Levent</td>
          </tr>
          <tr>
          <td>1</td>
          <td>1</td>
          <td>Etiler</td>
          </tr>
          <tr>
          <td>1</td>
          <td>1</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>2</td>
          <td>2</td>
          <td>Bakırk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>2</td>
          <td>Atak&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>2</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>3</td>
          <td>Kandilli</td>
          </tr>
          <tr>
          <td>2</td>
          <td>3</td>
          <td>Beylerbeyi</td>
          </tr>
          <tr>
          <td>2</td>
          <td>3</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Şof&ouml;r Tablosu</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Sid</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th></tr>
          <tr>
          <td>1</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Mehmet</td>
          <td>Honda</td>
          </tr>
          <tr>
          <td>3</td>
          <td>Tolga</td>
          <td>Ford</td>
          </tr>
          </tbody>
          </table>
          <p>&Ouml;ncelikle şof&ouml;r tablosu adında yeni bir tablo oluşturduk. Bu tabloda Sid (Şof&ouml;r ID) adıyla bir eşsiz anahtar yarattık ve Servis tablomuzdaki Sid kolonundan bu eşsiz anahtara referans vererek foreign key oluşturduk.</p>
          <p>3NF'i de g&ouml;rd&uuml;k ya... Artık karada &ouml;l&uuml;m yok.</p>
          <p>&nbsp;</p>
          <h3>BCNF / 3.5NF (Boyce-Codd Normal Form)</h3>
          <p><span style="font-family: Roboto, sans-serif; font-size: 18px; line-height: 1.6;">Bir veri tabanının 3.5NF olabilmesi i&ccedil;in aşağıdaki &ouml;zellikleri karşılayabilmesi gerekir:</span></p>
          <ul>
          <li><span style="line-height: 1.6;">Veri Tabanı 3NF olmalıdır,</span></li>
          <li><span style="line-height: 1.6;">Her determinant (belirleyici kolon) aynı zamanda bir aday anahtar olmalıdır.</span></li>
          </ul>
          <p><strong>Determinant:</strong>&nbsp;Aynı satırdaki diğer kolon değerlerini belirlemek i&ccedil;in kullanılan kolon k&uuml;mesi determinant olarak adlandırılır.</p>
          <p>Servis tablomuza dikkatle baktığımızda iki tane determinant olduğunu g&ouml;rebiliriz. <strong>Semt</strong> kolonu, <strong>Cid&nbsp;- Sid</strong>&nbsp;kombinasyonunun;&nbsp;<strong>Sid</strong> ise&nbsp;<strong>Cid</strong> kolonunun determinantıdır.</p>
          <p>Bu noktada Semt kolonunun hali hazırda bir aday anahtar olduğunu g&ouml;rebiliyoruz &ccedil;&uuml;nk&uuml; her bir değer&nbsp;tekrar oluşturmaksızın t&uuml;m kayıt satırını tanımlayabilmekte. &Ouml;te yandan Sid i&ccedil;in aynı&nbsp;şeyi s&ouml;ylemek m&uuml;mk&uuml;n değil &ccedil;&uuml;nk&uuml; tekrarlanıyor.</p>
          <p>Elbette bu durumu d&uuml;zeltmek i&ccedil;in tabloyu ikiye ayıracak semt tablosunun değerini tabloları ilişkilendirmek i&ccedil;in foreign key olarak kullanacağız.</p>
          <p><strong>Ana Tablo</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Id</th><th style="text-align: left;">Calisan</th><th style="text-align: left;">Soyad</th></tr>
          <tr>
          <td>1</td>
          <td>Or&ccedil;un</td>
          <td>Yılmaz</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Metin</td>
          <td>Seyyar</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Servis Tablosu&nbsp;</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Cid</th><th style="text-align: left;">Semt</th></tr>
          <tr>
          <td>1</td>
          <td>Levent</td>
          </tr>
          <tr>
          <td>1</td>
          <td>Etiler</td>
          </tr>
          <tr>
          <td>1</td>
          <td>Ulus</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Bakırk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Atak&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Yeşilk&ouml;y</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Kandilli</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Beylerbeyi</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Kuzguncuk</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Semt&nbsp;Tablosu&nbsp;</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Semt</th><th style="text-align: left;">Sid</th></tr>
          <tr>
          <td>Levent</td>
          <td>1</td>
          </tr>
          <tr>
          <td>Etiler</td>
          <td>1</td>
          </tr>
          <tr>
          <td>Ulus</td>
          <td>1</td>
          </tr>
          <tr>
          <td>Bakırk&ouml;y</td>
          <td>2</td>
          </tr>
          <tr>
          <td>Atak&ouml;y</td>
          <td>2</td>
          </tr>
          <tr>
          <td>Yeşilk&ouml;y</td>
          <td>2</td>
          </tr>
          <tr>
          <td>Kandilli</td>
          <td>3</td>
          </tr>
          <tr>
          <td>Beylerbeyi</td>
          <td>3</td>
          </tr>
          <tr>
          <td>Kuzguncuk</td>
          <td>3</td>
          </tr>
          </tbody>
          </table>
          <p>&nbsp;</p>
          <p><strong>Şof&ouml;r Tablosu</strong></p>
          <table class="table table-striped table-bordered table-hover table-condensed">
          <tbody>
          <tr><th style="text-align: left;">Sid</th><th style="text-align: left;">Sofor</th><th style="text-align: left;">Arac</th></tr>
          <tr>
          <td>1</td>
          <td>Ahmet</td>
          <td>Toyota</td>
          </tr>
          <tr>
          <td>2</td>
          <td>Mehmet</td>
          <td>Honda</td>
          </tr>
          <tr>
          <td>3</td>
          <td>Tolga</td>
          <td>Ford</td>
          </tr>
          </tbody>
          </table>
          <p>G&ouml;r&uuml;lebileceği gibi artık tablolarımızın hi&ccedil;birinde aday anahtar olmayan determinant yok. Bu nedenle veri tabanımız BCNF'tir diyebiliriz.</p>
          <p><strong>Not:</strong> Hazır Boyce - Codd demişken:&nbsp;<a href="http://en.wikipedia.org/wiki/Raymond_F._Boyce" target="_blank">Raymond F. Boyce</a>,&nbsp;<a href="http://en.wikipedia.org/wiki/Edgar_F._Codd" target="_blank">Edgar F. Codd</a>.</p>
          <p>&nbsp;</p>
          <h3>4NF (4. Normal Form)</h3>
          <p><span style="font-family: Roboto, sans-serif; font-size: 18px; line-height: 1.6;">Bir veri tabanının 4NF olabilmesi i&ccedil;in aşağıdaki &ouml;zellikleri karşılayabilmesi gerekir:</span></p>
          <ul>
          <li><span style="line-height: 1.6;">Veri Tabanı 3NF olmalıdır,</span></li>
          <li><span style="line-height: 1.6;">&Ccedil;ok-değerli bağımlılıkları (Multli-Valued dependency) olmamalıdır.</span></li>
          </ul>
          <p><strong>Multi-Valued Dependency:</strong>&nbsp;Bu durum bir ya da daha &ccedil;ok veri satırının var olması, aynı tabloda başka bir (ya da daha &ccedil;ok) veri satırının bulunmasını gerektirdiğinde ortaya &ccedil;ıkar. &Ouml;rneğin, bir yazılım firması d&uuml;ş&uuml;nelim. Geliştirdikleri yazılımların masa&uuml;st&uuml; bilgisayarlar i&ccedil;in olanlarını tek-kullanıcılı ve &ccedil;ok-kullanıcılı olarak iki versiyonla piyasaya sunuyor&nbsp;olsunlar. Diyelim ki bu firmanın geliştirdiği&nbsp;t&uuml;m yazılımları barındıran bir veri tabanı oluşturuyoruz. Bu veri tabanında bir masa&uuml;st&uuml; yazılımın tek-kullanıcılı versiyonunu eklediysek mutlaka bir&nbsp;başka satırda aynı yazılımın &ccedil;ok-kullanıcılı versiyonu i&ccedil;in de bir kayıt a&ccedil;ılmış olmak durumundadır...</p>
          <p>Hali hazır &ouml;rneğimizde b&ouml;yle bir durum oluşmadığından 4NF uyarlaması yapılmasına gerek (ve imkan) yoktur.</p>
          <p>&nbsp;</p>
          <h3>Sonu&ccedil;</h3>
          <p>En azından ilk &uuml;&ccedil; seviye normalizasyonu her zaman ve mutlaka yapmak gerektiğine inanıyorum. Ancak bazı &ouml;zel durumlarda (&Ouml;rneğin nadiren kayıt girişi yapılan fakat&nbsp;s&uuml;rekli yeni yeni sorgular yazılan&nbsp;bir veri tabanı d&uuml;ş&uuml;n&uuml;n) sorgularınızı kodlamanın biraz daha kolaylaşması i&ccedil;in bazı kolonların birden &ccedil;ok tabloda&nbsp;tekrarlanmasını isteyebilirsiniz. Bu t&uuml;rden durumlarda&nbsp;normalizasyonu bir seviyeden sonra yapmamayı&nbsp;tercih edebilirsiniz. O seviyenin 3NF'den aşağı olmamasını şiddetle tavsiye ederim. Yine de hi&ccedil; &uuml;şenge&ccedil;lik etmesek daha iyi tabii...</p>
          <p>&nbsp;</p>

          <p>&nbsp;</p>


                  <!-- Son: Sayfa İçeriği -->
                      </div>
                   </div>
                </div>
                <!--#İTEM-->











<!--İTEM
      <div class="col-4-grid">
         <div class="item">
            <div class="front-end">
              <div class="item-title">Need Blog Title 2</div>
               <img src="http://envirra.com/themes/espresso/wp-content/uploads/2015/03/13153244495_bf016e61c0_o.jpg" alt="" />
            </div>
            <div class="back-end">
              <div class="item-image">
                <img src="http://envirra.com/themes/espresso/wp-content/uploads/2015/03/13153244495_bf016e61c0_o.jpg" alt="" />
              </div>
              <div class="item-title">Need Blog Title 2</div>
              <p>As for the sign-painters'<b> whales seen in the streets hanging over the shops of oil-dealers, </b>what shall be said of them? They are generally Richard III. whales, with dromedary humps, and very savage; breakfasting on three or four sailor tarts, that is whaleboats full of mariners: their deformities floundering in seas of blood and blue paint.</p>

              <p>But the placing of the cap-sheaf to all this blundering business was reserved for the scientific Frederick Cuvier, brother to the famous Baron. In 1836, he published a Natural History of Whales, in which he gives what he calls a picture of the Sperm Whale.<b> Before showing that picture to any Nantucketer,</b> you had best provide for your summary retreat from Nantucket. In a word, Frederick Cuvier's Sperm Whale is not a Sperm Whale, but a squash. Of course, he never had the benefit of a whaling voyage (such men seldom have), but whence he derived that picture, who can tell? Perhaps he got it as his scientific predecessor in the same field, Desmarest, got one of his authentic abortions; that is, from a Chinese drawing. And what sort of lively lads with the pencil those Chinese are, many queer cups and saucers inform us.</p>

              <p>But these manifold mistakes in depicting the whale are not so very surprising after all. Consider! Most of the scientific drawings have been taken from the stranded fish; and these are about as correct as a drawing of a wrecked ship, with broken back, would correctly represent the noble animal itself in all its undashed pride of hull and spars. Though elephants have stood for their full-lengths, the living Leviathan has never yet fairly floated himself for his portrait. The living whale, in his full majesty and significance, is only to be seen at sea in unfathomable waters; and afloat the vast bulk of him is out of sight, like a launched line-of-battle ship; and out of that element it is a thing eternally impossible for mortal man to hoist him bodily into the air, so as to preserve all his mighty swells and undulations. And, not to speak of the highly presumable difference of contour between a young sucking whale and a full-grown Platonian Leviathan; yet, even in the case of one of those young sucking whales hoisted to a ship's deck, such is then the outlandish, eel-like, limbered, varying shape of him, that his precise expression the devil himself could not catch.</p>

              <p>But it may be fancied, that from the naked skeleton of the stranded whale, accurate hints may be derived touching his true form. Not at all. For it is one of the more curious things about this Leviathan, that his skeleton gives very little idea of his general shape. Though Jeremy Bentham's skeleton, which hangs for candelabra in the library of one of his executors, correctly conveys the idea of a burly-browed utilitarian old gentleman, with all Jeremy's other leading personal characteristics; yet nothing of this kind could be inferred from any leviathan's articulated bones. In fact, as the great Hunter says, the mere skeleton of the whale bears the same relation to the fully invested and padded animal as the insect does to the chrysalis that so roundingly envelopes it. This peculiarity is strikingly evinced in the head, as in some part of this book will be incidentally shown. It is also very curiously displayed in the side fin, the bones of which almost exactly answer to the bones of the human hand, minus only the thumb. This fin has four regular bone-fingers, the index, middle, ring, and little finger. But all these are permanently lodged in their fleshy covering, as the human fingers in an artificial covering. "However recklessly the whale may sometimes serve us," said humorous Stubb one day, "he can never be truly said to handle us without mittens."</p>

              <p>For all these reasons, then, any way you may look at it, you must needs conclude that the great Leviathan is that one creature in the world which must remain unpainted to the last. True, one portrait may hit the mark much nearer than another, but none can hit it with any very considerable degree of exactness. So there is no earthly way of finding out precisely what the whale really looks like. And the only mode in which you can derive even a tolerable idea of his living contour, is by going a whaling yourself; but by so doing, you run no small risk of being eternally stove and sunk by him. Wherefore, it seems to me you had best not be too fastidious in your curiosity touching this Leviathan.</p>
            </div>
         </div>
      </div>
      <!--#İTEM-->

<!--SHOW ITEM-->
<div class="show-item">
  <div class="show-item-close"></div>
  <!--CONTAINER600-->
  <div class="container600 single">

  </div>
  <!--#CONTAINER600-->
  <div class="show-item-back-top"></div>
</div>
<!--#SHOW ITEM-->
    <script src='http://cdnjs.cloudflare.com/ajax/libs/jquery/2.1.3/jquery.min.js'></script>

        <script src="js/index.js"></script>




  </body>
</html>
